# RelativeRoughness Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RelativeRoughness Property
ParameterTypeId Class See Also
---
"Relative Roughness"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RelativeRoughness { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RelativeRoughness As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RelativeRoughness {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace